In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Series的排序

In [3]:
s1 = Series(np.random.randn(10))

In [4]:
s1

0    0.084657
1   -0.501948
2    0.237186
3   -1.480518
4   -0.037066
5    2.614151
6    1.182775
7   -1.900587
8   -0.911004
9   -0.619295
dtype: float64

In [5]:
s1.values

array([ 0.08465668, -0.50194847,  0.23718577, -1.48051761, -0.03706643,
        2.6141505 ,  1.18277512, -1.90058712, -0.91100364, -0.61929533])

In [6]:
s1.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
s2 = s1.sort_values(ascending=False)

In [8]:
s2

5    2.614151
6    1.182775
2    0.237186
0    0.084657
4   -0.037066
1   -0.501948
9   -0.619295
8   -0.911004
3   -1.480518
7   -1.900587
dtype: float64

In [9]:
s2.sort_index()

0    0.084657
1   -0.501948
2    0.237186
3   -1.480518
4   -0.037066
5    2.614151
6    1.182775
7   -1.900587
8   -0.911004
9   -0.619295
dtype: float64

# Dataframe的排序

In [10]:
df1 = DataFrame(np.random.randn(40).reshape(8,5), columns=['A','B','C','D','E'])

In [11]:
df1

          A         B         C         D         E
0  0.745535 -1.225886  0.455421  0.361876  0.740708
1  0.716446  0.221984  1.895794 -0.218534 -0.394482
2 -0.357597 -0.801388  0.359851 -0.152835 -1.544141
3 -2.011790  0.863934 -0.360802 -0.572859 -0.738997
4  1.755475 -0.682866 -1.905142 -1.792424  0.603157
5  0.764764  0.617362  1.699967 -1.177330  0.538042
6 -0.976728  1.100507 -1.416792  0.789803  0.676727
7  1.100776 -0.127788  0.652165  0.123399 -0.598480

In [12]:
df1['A'].sort_values()

3   -2.011790
6   -0.976728
2   -0.357597
1    0.716446
0    0.745535
5    0.764764
7    1.100776
4    1.755475
Name: A, dtype: float64

In [13]:
df2 = df1.sort_values('A')

In [14]:
df2

          A         B         C         D         E
3 -2.011790  0.863934 -0.360802 -0.572859 -0.738997
6 -0.976728  1.100507 -1.416792  0.789803  0.676727
2 -0.357597 -0.801388  0.359851 -0.152835 -1.544141
1  0.716446  0.221984  1.895794 -0.218534 -0.394482
0  0.745535 -1.225886  0.455421  0.361876  0.740708
5  0.764764  0.617362  1.699967 -1.177330  0.538042
7  1.100776 -0.127788  0.652165  0.123399 -0.598480
4  1.755475 -0.682866 -1.905142 -1.792424  0.603157

In [15]:
df2.sort_index()

          A         B         C         D         E
0  0.745535 -1.225886  0.455421  0.361876  0.740708
1  0.716446  0.221984  1.895794 -0.218534 -0.394482
2 -0.357597 -0.801388  0.359851 -0.152835 -1.544141
3 -2.011790  0.863934 -0.360802 -0.572859 -0.738997
4  1.755475 -0.682866 -1.905142 -1.792424  0.603157
5  0.764764  0.617362  1.699967 -1.177330  0.538042
6 -0.976728  1.100507 -1.416792  0.789803  0.676727
7  1.100776 -0.127788  0.652165  0.123399 -0.598480

In [16]:
df1

          A         B         C         D         E
0  0.745535 -1.225886  0.455421  0.361876  0.740708
1  0.716446  0.221984  1.895794 -0.218534 -0.394482
2 -0.357597 -0.801388  0.359851 -0.152835 -1.544141
3 -2.011790  0.863934 -0.360802 -0.572859 -0.738997
4  1.755475 -0.682866 -1.905142 -1.792424  0.603157
5  0.764764  0.617362  1.699967 -1.177330  0.538042
6 -0.976728  1.100507 -1.416792  0.789803  0.676727
7  1.100776 -0.127788  0.652165  0.123399 -0.598480

# 作业
只需要 imdb_score、director_name、movie_title这三列，且按照 imdb_score 的降序排列

只用一行代码实现

数据用 ../homework/movie_metadata.csv

In [26]:
csv_input = '../homework/movie_metadata.csv'
pd.read_csv(csv_input)[['movie_title', 'director_name', 'imdb_score']].sort_values('imdb_score', ascending=False).to_csv('./imdb_copy.csv')

In [27]:
!ls

1Series和DataFrame的简单数学运算.ipynb
2Series和DataFrame的排序.ipynb
3重命名DataFrame的Index.ipynb
Concatenate和Combine.ipynb
DataFrame的merge操作.ipynb
Untitled.ipynb
imdb.csv
imdb_copy.csv
分组和透视表功能实战.ipynb
数据分箱技术Binning.ipynb
数据分组技术GroupBy.ipynb
数据聚合技术Aggregation.ipynb
时间序列数据的采样和画图.ipynb
时间序列的操作基础.ipynb
透视表.ipynb
通过apply进行数据预处理.ipynb
通过去重进行数据清洗.ipynb

In [18]:
df_results = pd.read_csv('imdb.csv')

In [19]:
df_results

,Unnamed: 0,movie_title,director_name,imdb_score
0,2765,Towering Inferno,John Blanchard,9.5
1,1937,The Shawshank Redemption,Frank Darabont,9.3
2,3466,The Godfather,Francis Ford Coppola,9.2
3,4409,Kickboxer: Vengeance,John Stockwell,9.1
4,2824,Dekalog,NaN,9.1
...,...,...,...,...
5038,2268,Disaster Movie,Jason Friedberg,1.9
5039,2295,Superbabies: Baby Geniuses 2,Bob Clark,1.9
5040,4605,The Helix... Loaded,A. Raven Cruz,1.9
5041,1136,Foodfight!,Lawrence Kasanoff,1.7
5042,2834,Justin Bieber: Never Say Never,Jon M. Chu,1.6